Revit 2024 API
RebarShapeParameters.GetExternalDefinitionForElementId Method
 Seach a DefinitionFile for the ExternalDefinition corresponding to a parameter in a document.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalDefinition GetExternalDefinitionForElementId(
	Document doc,
	ElementId paramId,
	DefinitionFile definitionFile
)
Visual Basic
Public Shared Function GetExternalDefinitionForElementId ( _
	doc As Document, _
	paramId As ElementId, _
	definitionFile As DefinitionFile _
) As ExternalDefinition
Visual C++
public:
static ExternalDefinition^ GetExternalDefinitionForElementId(
	Document^ doc,
	ElementId^ paramId,
	DefinitionFile^ definitionFile
)
Parameters
doc
Type: Autodesk.Revit.DB.Document
A document.
paramId
Type: Autodesk.Revit.DB.ElementId
The id of a shared parameter in the document.
definitionFile
Type: Autodesk.Revit.DB.DefinitionFile
A database of shared parameters.
Return Value
 The external parameter corresponding to the parameter's ElementId, or null if the Id does not correspond to an external parameter, or the parameter is not in the definition file.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null.
See Also
RebarShapeParameters Class
Autodesk.Revit.DB.Structure Namespace